import random


def find_coprime(n):
    """Находит взаимно простое число с n."""

    def gcd(a, b):
        while b:
            a, b = b, a % b
        return a

    coprime = n  # Инициализируем coprime числом, большим n
    while gcd(n, coprime) != 1:
        coprime -= random.randint(1, 100)
    return coprime

# Пример использования
n = 127152730157675675920649907653408152827141289868286507955517908667551494855452850288416601944646892871215776147782878182097121378590278127309378785571440973890057744951218377638399252180943170737861036425094947267717087386038955950894923018090089626449467155562364446743529455788536341674437125823560888800843

coprime = find_coprime(n)
print(f"Взаимно простое с {n} число: {coprime}")
print(n > coprime)
